your_lang = 'Это твой язык'

hi = """Я - Макс, твой виртуальный беговой напарник. Буду поддерживать тебя на дистанции этого квиза. Для начала представься — как тебя зовут?😁"""

phone = """Приятно познакомиться! 😎 Оставь свой телефон, чтобы мы могли связаться с тобой в случае выигрыша. 🎉"""

bad_phone = """Не нужно писать цифры, просто нажми на кнопку внизу экрана ⤵️"""

email = """А теперь - твой email 📩 
Обещаю - никакого спама, только важные уведомления о стартах и детали розыгрыша. 
"""

bad_email = """Хм... Кажется, здесь затесался лишний котик 🐱 Проверь, чтобы было так: example@mail.ru. """

email_ok = """Всё готово! ✅"""

begin = """Данные собраны, контакты на месте. Теперь ты официально зарегистрирован в нашем квизе! ⚡️

Нажми на кнопку внизу экрана, чтобы узнать правила ⤵️
"""

rules = """🚩ПРАВИЛА КВИЗА 🚩

Наши правила проще, чем утренняя пробежка:

🔴 Два раунда по 5 вопросов;
🔴 В каждом вопросе - варианты ответов;
🔴 Выбирай вариант и жми кнопку, как на трекере пульса! 

Готов начинать? Жми на кнопку внизу экрана ⤵️ 
"""

round1 = """🚩РАУНД 1 🚩

Первый раунд — факты, даты и числа. 👀 Если не уверен в ответе — доверься интуиции и пытайся угадать. Главное — действуй быстро, как на старте! 💨

Жми на кнопку внизу экрана, чтобы начать ⤵️ 
"""

round2 = """🚩РАУНД 2 🚩

Второй раунд — самое интересное! 😁 Здесь вопросы, которые мы задали опытным триатлетам. Твоя задача — угадать самый популярный ответ! Думай, как бы ответили профи, и включай спортивную интуицию! 🧠🏆
"""


corrects = ["Правильно! 🎯 Так держать!",
            'Верный ответ! ✅ Ты на верном пути!',
            'Точно! 👍 Это правильный вариант!',
            'Да! 🏆 Ответ верный!',
            'Верно! 💪 Отлично справился!',
            'Верный ответ! 🚀 Так держать!',
            'Точно! ✅ Это правильный ответ!',
            'Да! 💯 Именно так!',
            ]

wrongs = ['❌ Ответ неверный!',
          'Не угадал! Зато теперь ты знаешь правильный ответ 👍',
          'Мимо! 😢 Но каждая ошибка — это шаг к победе.',
          'Неверно! Но это не повод останавливаться 🏃‍♂️',
          'Увы, этот ответ неправильный 👎',
          'Ты был близок к правильному ответу, но это не он 😕',]
question_1 = """🚩ВОПРОС 1 🚩

Сколько этапов в классическом триатлоне? 

1) Один (велогонка)
2) Два (велогонка, бег)
3) Три (плавание, велогонка, бег)
4) Четыре (плавание, велогонка, бег, танцы)

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️
"""

question_2 = """🚩ВОПРОС 2 🚩

Какой год подряд IRONSTAR проводит фестиваль в Сириусе (Сочи)? 

1) 12
2) 11
3) 10
4) 9

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ 
"""
question_3 = """🚩ВОПРОС 3 🚩

Где состоится следующий международный старт IRONSTAR в 2026 году? 

1) ЮАР
2) Австралия
3) Казахстан
4) Египет

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ 
"""
question_4 = """🚩ВОПРОС 4 🚩

Как называется фестиваль IRONSTAR, который пройдет зимой 2026 года в Одинцово? 

1) IRONSTAR WINTER
2) BRR-RONSTAR 
3) IRONSTAR FROZEN
4) IRONSTAR WINTER IS COMING 

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ """

question_5 = """🚩ВОПРОС 5 🚩

Какой вариант прохода в транзитной зоне существует? 

1) Галопом
2) Кабанчиком
3) Зайчиком
4) Лягушкой

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ """
question_6 = """🚩ВОПРОС 6 🚩

Как понять, что ты на забеге? 

1) Все бегут, и ты бежишь
2) Все стоят в очереди к туалету
3) Повсюду спортсмены
4) Тебе кричат еще «Чуть-чуть», но это враньё

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ """
question_7 = """🚩ВОПРОС 7 🚩

Что чаще всего чувствует участник за 5 минут до старта? 

1) Абсолютное спокойствие
2) Готовность побить мировой рекорд
3) Лёгкий голод
4) Желание убежать домой

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ """
question_8 = """🚩ВОПРОС 8 🚩

Что самое сложное в триатлоне?

1) Побороть желание свернуть с трассы в ближайшее кафе или бар
2) Найти свой велосипед в транзитной зоне
3) Сохранить лицо и достоинство, когда тебя обгоняет 70 летний дедушка.
4) После велоэтапа вспомнить, что впереди еще беговой этап

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ """
question_9 = """🚩ВОПРОС 9 🚩

Кто главный враг бегуна или триатлета?

1) Диван
2) Дождь
3) Холод
4) Пункт питания

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ """

question_10 = """🚩ВОПРОС 10 🚩

Что обязательно есть у триатлета?

1) Велосипед по стоимости машины
2) Куча кроссовок
3) Татуировка с финишной дистанцией
4) Слот на IRONSTAR

Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️
"""

comment_1 = """Конечно, в классическом триатлоне 3 этапа: 🏊‍♀️ плавание, 🚴‍♀️велогонка, 🏃‍♂️бег. 
Хотя танцы - тоже неотъемлемая часть фестиваля IRONSTAR! 💃"""
comment_2 = """Впервые IRONSTAR SIRIUS состоялся в 2014 году. А в этом сезоне IRONSTAR SIRIUS пройдет 3-5 октября 2025. Приглашаю принять участие!
"""
comment_3 = """ IRONSTAR EGYPT пройдет с 30 января по 1 февраля 2026 в Шарм Эль Шейхе. Буду рад видеть тебя на старте! 🚩"""
comment_4 = """IRONSTAR - это не только триатлон, но и лыжные гонки с трейлом. IRONSTAR WINTER пройдет 24-25 января 2026 года. Регистрируйся и увидимся на старте! 👋
"""
comment_5 = """Галопом, зайчиком и лягушкой бегают на каких-то других стартах. А в триатлоне мы бегаем кабанчиком. Кстати, сейчас самое время побежать кабанчиком в следующий раунд! """
comment_6 = """ На забегах IRONLADY и MANSTAR ты сам в этом убедишься. Регистрируйся! 😁
"""
comment_7 = """Большинство триатлетов признались, что они чувствуют желание убежать домой, но домой еще никто не убегал.😁 Все просят «ещё». За «ещё» заходи на сайт 👉 iron-star.com
"""
comment_8 = """Хочешь узнать, что будет самым сложным для тебя? Регистрируйся на старты IRONSTAR 2026!
"""
comment_9 = """Побеждай своих врагов! Ставь свои спортивные цели в 2026 году вместе с IRONSTAR!
"""
comment_10 = """Твой слот ждёт тебя на  👉 iron-star.com. Переходи по ссылке и пробуй себя в триатлоне! 🏊‍♀️🚴‍♀️🏃‍♂️"""

end = """Готов узнать свой результат? Сейчас посчитаем твои правильные ответы! 📊 Жми на кнопку ⤵️"""

def generate_result(correct_num):
    return f"""Ты ответил правильно на {correct_num} вопросов из 10. 💪
    
Ты можешь стать участником розыгрыша призов от IRONSTAR. Подпишись на канал @ironstar_official, чтобы участвовать в розыгрыше.
"""

def generate_num(giveaway_number):
    return f"""Отлично! Ты официально в розыгрыше! 🏆 Твой номер участника: {giveaway_number}
    
Следи за новостями на канале @ironstar_official. Розыгрыш уже скоро! 😎
"""

thanks = """Спасибо за участие! 💪 Расскажи, как тебе квиз? Твой фидбек важен для нас. Нажми на одну из кнопок ниже 👇
"""

bye = """Спасибо тебе, чемпион, и до встречи на трассе!

Забегай на наш сайт 👉  iron-star.com — там всё о беге, триатлоне и новых стартах IRONSTAR 🔥"""

not_subscribed = 'Для участия в розыгрыше нужно подписаться на канал'