your_lang = 'Это твой язык'

hi = """Я - Макс, твой виртуальный беговой напарник. Буду поддерживать тебя на дистанции этого квиза. Для начала представься — как тебя зовут?😁"""

phone = """Приятно познакомиться! 😎 Оставь свой телефон, чтобы мы могли связаться с тобой в случае выигрыша. 🎉

Не нужно писать цифры, просто нажми на кнопку внизу экрана ⤵️"""

bad_phone = """Не нужно писать цифры, просто нажми на кнопку внизу экрана ⤵️"""

email = """А теперь - твой email 📩 
Обещаю - никакого спама, только важные уведомления о стартах и детали розыгрыша. 
"""

bad_email = """Хм... Кажется, здесь затесался лишний котик 🐱 Проверь, чтобы было так: example@mail.ru. """


begin = """Всё готово! ✅

Данные собраны, контакты на месте. Теперь ты официально зарегистрирован в нашем квизе! ⚡️

Нажми на кнопку внизу экрана, чтобы узнать правила ⤵️
"""

rules = """🚩ПРАВИЛА КВИЗА 🚩

Наши правила проще, чем утренняя пробежка:

🔴 Два раунда по 5 вопросов;
🔴 В каждом вопросе - варианты ответов;
🔴 Выбирай вариант и жми кнопку, как на трекере пульса! 

Готов начинать? Жми на кнопку внизу экрана ⤵️ 
"""

round1 = """🚩РАУНД 1 🚩

Первый раунд — факты, даты и числа. 👀 Если не уверен в ответе — доверься интуиции и пытайся угадать. Главное — действуй быстро, как на старте! 💨

Жми на кнопку внизу экрана, чтобы начать ⤵️ 
"""

round2 = """🚩РАУНД 2 🚩

Второй раунд — самое интересное! 😁 Здесь вопросы, которые мы задали опытным триатлетам. Твоя задача — угадать самый популярный ответ! Думай, как бы ответили профи, и включай спортивную интуицию! 🧠🏆
"""


corrects = ["Правильно! 🎯 Так держать!",
            'Верный ответ! ✅ Ты на верном пути!',
            'Точно! 👍 Это правильный вариант!',
            'Да! 🏆 Ответ верный!',
            'Верно! 💪 Отлично справился!',
            'Верный ответ! 🚀 Так держать!',
            'Точно! ✅ Это правильный ответ!',
            'Да! 💯 Именно так!',
            ]

wrongs = ['❌ Ответ неверный!',
          'Не угадал! Зато теперь ты знаешь правильный ответ 👍',
          'Мимо! 😢 Но каждая ошибка — это шаг к победе.',
          'Неверно! Но это не повод останавливаться 🏃‍♂️',
          'Увы, этот ответ неправильный 👎',
          'Ты был близок к правильному ответу, но это не он 😕',]
question_1 = """<b>🚩ВОПРОС 1 🚩
Сколько этапов в классическом триатлоне? </b>

1) Один (велогонка)
2) Два (велогонка, бег)
3) Три (плавание, велогонка, бег)
4) Четыре (плавание, велогонка, бег, танцы)

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️</b>
"""

question_2 = """<b>🚩ВОПРОС 2 🚩
Какой год подряд IRONSTAR проводит фестиваль в Сириусе (Сочи)? </b>

1) 12
2) 11
3) 10
4) 9

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ </b>
"""
question_3 = """<b>🚩ВОПРОС 3 🚩
Где состоится следующий международный старт IRONSTAR в 2026 году? </b>

1) ЮАР
2) Австралия
3) Казахстан
4) Египет

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ </b>
"""
question_4 = """<b>🚩ВОПРОС 4 🚩
Как называется фестиваль IRONSTAR, который пройдет зимой 2026 года в Одинцово? </b>

1) IRONSTAR WINTER
2) BRR-RONSTAR 
3) IRONSTAR FROZEN
4) IRONSTAR WINTER IS COMING 

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️</b> """

question_5 = """<b>🚩ВОПРОС 5 🚩
Что такое «транзитная зона» в триатлоне?</b>

1) Место, где можно передохнуть и позвонить родным
2) Участок трассы между городом и лесом
3) Специально отведенное место, где происходит смена этапов (переодевание, смена экипировки)
4) Зона, где время замедляется, а триатлеты движутся в режиме "слоумо"

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️</b>"""

question_6 = """<b>🚩ВОПРОС 6 🚩
Как понять, что ты на забеге? </b>

1) Все бегут, и ты бежишь
2) Все стоят в очереди к туалету
3) Повсюду спортсмены
4) Тебе кричат еще «Чуть-чуть», но это враньё

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ </b>"""

question_7 = """<b>🚩ВОПРОС 7 🚩
Что чаще всего чувствует участник за 5 минут до старта? </b>

1) Абсолютное спокойствие
2) Готовность побить мировой рекорд
3) Лёгкий голод
4) Желание убежать домой

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ </b>"""

question_8 = """<b>🚩ВОПРОС 8 🚩
Что самое сложное в триатлоне?</b>

1) Побороть желание свернуть с трассы в ближайшее кафе или бар
2) Найти свой велосипед в транзитной зоне
3) Сохранить лицо и достоинство, когда тебя обгоняет 70-летний дедушка.
4) После велоэтапа вспомнить, что впереди еще беговой этап

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ </b>"""

question_9 = """<b>🚩ВОПРОС 9 🚩
Кто главный враг бегуна или триатлета?</b>

1) Диван
2) Дождь
3) Холод
4) Пункт питания

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️ </b>"""

question_10 = """<b>🚩ВОПРОС 10 🚩
Что обязательно есть у триатлета?</b>

1) Велосипед по стоимости машины
2) Куча кроссовок
3) Татуировка с финишной дистанцией
4) Слот на IRONSTAR

<b>Жми на кнопку внизу экрана, чтобы выбрать ответ ⤵️</b>
"""

comment_1 = """<b>✅  Правильный ответ: 3️⃣ Три (плавание, велогонка, бег)</b>

Конечно, в классическом триатлоне 3 этапа: 🏊‍♀️ плавание, 🚴‍♀️ велогонка, 🏃‍♂️ бег.  Хотя танцы - тоже неотъемлемая часть фестиваля IRONSTAR! 💃"""


comment_2 = """<b>✅  Правильный ответ: 2️⃣ 11</b>

Впервые IRONSTAR SIRIUS состоялся в 2015 году. А в этом сезоне IRONSTAR SIRIUS пройдет 3-5 октября 2025. Ты еще успеешь принять в нём участие! ☝️
"""
comment_3 = """<b>✅  Правильный ответ: 4️⃣ Египет</b>

IRONSTAR EGYPT пройдет с 30 января по 1 февраля 2026 в Шарм Эль Шейхе. Буду рад видеть тебя на старте! 🚩
"""
comment_4 = """<b>✅  Правильный ответ: 1️⃣  IRONSTAR WINTER</b>

⚡️ IRONSTAR - это не только триатлон, но и лыжные гонки с трейлом. IRONSTAR WINTER пройдет 24-25 января 2026 года. Регистрируйся на 👉 iron-star.com и увидимся на старте! 👋

"""
comment_5 = """<b>✅  Правильный ответ: 3️⃣ Специально отведенное место, где происходит смена этапов (переодевание, смена экипировки). </b>

Самая большая транзитная зона на фестивалях IRONSTAR - в Москве и Сириусе. Только представь - там стоят более 2000 велосипедов!
 """
comment_6 = """<b>✅ Самый популярный ответ: 2️⃣ Все стоят в очереди к туалету</b>

Действительно, на забегах все стоят в очереди к туалету. А на забегах IRONLADY и MANSTAR ты сам в этом убедишься. Регистрируйся и вперёд! 😁

"""
comment_7 = """<b>✅ Самый популярный ответ: 4️⃣Желание убежать домой</b>

Большинство триатлетов признались, что они чувствуют желание убежать домой, но домой еще никто не убегал.😁 Все просят «ещё». За «ещё» заходи на сайт 👉 iron-star.com

"""
comment_8 = """<b>✅ Самый популярный ответ: 3️⃣Сохранить лицо и достоинство, когда тебя обгоняет 70-летний дедушка.</b>

Хочешь узнать, что будет самым сложным для тебя? Регистрируйся на старты IRONSTAR 2026!

"""
comment_9 = """<b>✅ Самый популярный ответ: 1️⃣Диван</b>

Диван затягивает бегуна быстрее, чем болото. 😁 Побеждай своих врагов! Ставь свои спортивные цели в 2026 году вместе с IRONSTAR!

"""
comment_10 = """<b>✅ Самый популярный ответ: 4️⃣Слот на IRONSTAR ⚡️</b>

Конечно, у каждого триатлета есть слот на IRONSTAR! Твой слот ждёт тебя на  👉 iron-star.com. Переходи по ссылке и пробуй себя в триатлоне! 🏊‍♀️🚴‍♀️🏃‍♂️
"""

end = """Готов узнать свой результат? Сейчас посчитаем твои правильные ответы! 📊 Жми на кнопку ⤵️"""

def generate_result(correct_num):
    return f"""Ты ответил правильно на {correct_num} вопросов из 10. 💪
    
Ты можешь стать участником розыгрыша призов от IRONSTAR. Подпишись на канал @ironstar_official, чтобы участвовать в розыгрыше.
"""

def generate_num(giveaway_number):
    return f"""Отлично! Ты официально в розыгрыше! 🏆 Твой номер участника: {giveaway_number}
    
Следи за новостями на канале @ironstar_official. Розыгрыш уже скоро! 😎
"""

thanks = """Кстати, как тебе квиз? Твой фидбек важен для нас. Нажми на одну из кнопок ниже 👇
"""

bye = """Спасибо за участие! Забегай на наш сайт 👉  iron-star.com — там всё о беге, триатлоне и новых стартах IRONSTAR 🔥

До встречи на трассе! 👋
"""

not_subscribed = 'Для участия в розыгрыше нужно подписаться на канал'

next_round = """А мы с тобой переходим в транзитную зону квиза и попадаем в следующий раунд! Жми на кнопку внизу экрана ⤵️ """